# US - Baby Names

### Introduction:

We are going to use a subset of [US Baby Names](https://www.kaggle.com/kaggle/us-baby-names) from Kaggle.  
In the file it will be names from 2004 until 2014


### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/06_Stats/US_Baby_Names/US_Baby_Names_right.csv).

### Step 3. Assign it to a variable called baby_names.

In [2]:
baby_names = pd.read_csv("US_Baby_Names_right.csv")

### Step 4. See the first 10 entries

In [3]:
baby_names.head()

   Unnamed: 0     Id     Name  Year Gender State  Count
0       11349  11350     Emma  2004      F    AK     62
1       11350  11351  Madison  2004      F    AK     48
2       11351  11352   Hannah  2004      F    AK     46
3       11352  11353    Grace  2004      F    AK     44
4       11353  11354    Emily  2004      F    AK     41

### Step 5. Delete the column 'Unnamed: 0' and 'Id'

In [5]:
del baby_names['Unnamed: 0']
del baby_names['Id']

### Step 6. Is there more male or female names in the dataset?

In [6]:
baby_names['Gender'].value_counts()

F    558846
M    457549
Name: Gender, dtype: int64

### Step 7. Group the dataset by name and assign to names

In [7]:
names = baby_names.groupby('Name')

### Step 8. How many different names exist in the dataset?

In [11]:
baby_names['Name'].nunique()

17632

### Step 9. What is the name with most occurrences?

In [20]:
min(names['Count'].sum())

5

### Step 10. How many different names have the least occurrences?

In [15]:
names.size()[names.size() == 1]

Name
Aadarsh       1
Aadhav        1
Aadin         1
Aahna         1
Aaima         1
             ..
Zykeriah      1
Zykierra      1
Zymari        1
Zyquavious    1
Zyren         1
Length: 3682, dtype: int64

### Step 11. What is the median name occurrence?

In [ ]:
names[''.agg()

### Step 12. What is the standard deviation of names?

In [28]:
names['Count'].sum().median()

49.0

### Step 13. Get a summary with the mean, min, max, std and quartiles.

In [30]:
names['Count'].sum().agg(['mean', 'min', 'max', 'std', 'median'])

mean        2008.932169
min            5.000000
max       242874.000000
std        11006.069468
median        49.000000
Name: Count, dtype: float64